{
  "Cyclone Ditwah": {
    "timestamp": "2025-12-02T01:59:12.019538",
    "articles": [
      {
        "source": "Statetimes.in",
        "title": "PM Modi stresses urgent need to transform public perception of police",
        "url": "https://statetimes.in/pm-modi-stresses-urgent-need-to-transform-public-perception-of-police/",
        "description": "STATE TIMES NEWS RAIPUR: Prime Minister Narendra Modi on Sunday stressed the urgent need to transform public perception of the police, particularly among the youth, by enhancing professionalism, sensitivity and responsiveness. Addressing the 60th All India Co…",
        "published_at": "2025-11-30T19:10:54Z"
      },
      {
        "source": "Slashdot.org",
        "title": "Death toll hits 212 as Sri Lanka struggles with Cyclone Ditwah impact - Reuters",
        "url": "https://slashdot.org/firehose.pl?op=view&amp;id=180244823",
        "description": "Death toll hits 212 as Sri Lanka struggles with Cyclone Ditwah impactReuters At least 193 dead in Sri Lanka flood, with many more missingBBC As Cyclone Deaths Pass 150, Sri Lanka Is Overwhelmed by Rescue DemandThe New York Times ‘Neighbourhoods buried under m…",
        "published_at": "2025-11-30T18:12:38Z"
      },
      {
        "source": "The Times of India",
        "title": "Cyclone Ditwah batters Sri Lanka as death toll crosses 330",
        "url": "https://economictimes.indiatimes.com/news/international/world-news/cyclone-ditwah-batters-sri-lanka-as-death-toll-crosses-330/articleshow/125677714.cms",
        "description": "Sri Lanka continues relief efforts following Cyclone Ditwah. India is providing crucial assistance. Over 330 lives were lost and many are missing. Thousands are affected by severe weather. Indian NDRF and IAF teams are working tirelessly. They are conducting …",
        "published_at": "2025-11-30T18:01:50Z"
      },
      {
        "source": "The Times of India",
        "title": "Cyclone Ditwah: 375 pregnant women shifted to hospitals amid alert in Andhra Pradesh",
        "url": "https://economictimes.indiatimes.com/news/india/cyclone-ditwah-375-pregnant-women-shifted-to-hospitals-amid-alert-in-andhra-pradesh/articleshow/125676987.cms",
        "description": "Andhra Pradesh authorities are taking swift action as cyclone Ditwah approaches. Nearly 7,900 pregnant women nearing delivery have been identified in vulnerable districts. A significant number, 375, have already been moved to hospitals for safety. Medical sta…",
        "published_at": "2025-11-30T17:28:23Z"
      },
      {
        "source": "BusinessLine",
        "title": "Cyclonexa0Ditwahxa0retains status, winds to wind down",
        "url": "https://www.thehindubusinessline.com/economy/agri-business/cycloneditwahretains-status-winds-to-wind-down/article70341846.ece",
        "description": "Cyclonexa0Ditwahxa0was located about 100 km east-southeast of Cuddalore, 110 km north-east of Karaikal, 100 km east-southeast of Puducherry, 150 km north-northeast of Vedaranniyam and 170 km south-southeast of Chennai (India) by Sunday afternoon",
        "published_at": "2025-11-30T16:35:01Z"
      },
      {
        "source": "Statetimes.in",
        "title": "Cyclone Ditwah expected to weaken into deep depression late on Sunday: Met Office",
        "url": "https://statetimes.in/cyclone-ditwah-expected-to-weaken-into-deep-depression-late-on-sunday-met-office/",
        "description": "CHENNAI: Cyclone Ditwah is expected to weaken into a deep depression and the weather system would be centred over southwest Bay of Bengal within a minimum distance of 30 km from the coasts of North Tamil Nadu and Puducherry by midnight of Sunday, the Regional…",
        "published_at": "2025-11-30T15:43:31Z"
      },
      {
        "source": "BusinessLine",
        "title": "IAF and other airlines fly homexa0stranded tourists from Sri Lanka",
        "url": "https://www.thehindubusinessline.com/economy/logistics/iaf-airlines-fly-homestranded-tourists-from-sri-lanka/article70342160.ece",
        "description": "Another 398 passengers returned on Air India flights to Delhi and Mumbai. While IndiGo said its flights to Colombo were operating as per schedule, a Sri Lankan airlines spokesperson said its operations would normalise by Sunday midnight.",
        "published_at": "2025-11-30T14:21:44Z"
      },
      {
        "source": "The Times of India",
        "title": "Death toll hits 212 as Sri Lanka struggles with Cyclone Ditwah impact",
        "url": "https://economictimes.indiatimes.com/news/international/world-news/death-toll-hits-212-as-sri-lanka-struggles-with-cyclone-ditwah-impact/articleshow/125674440.cms",
        "description": "Cyclone Ditwah has claimed 212 lives in Sri Lanka, with 218 people missing. Floodwaters breached a dam, impacting nearly a million people. Rescue operations are ongoing. Thousands are in shelters as rivers overflowed and landslides occurred. Power, water, and…",
        "published_at": "2025-11-30T14:15:33Z"
      },
      {
        "source": "The Times of India",
        "title": "Cyclone Ditwah to intensify rainfall across Andhra Pradesh: IMD",
        "url": "https://economictimes.indiatimes.com/news/india/cyclone-ditwah-to-intensify-rainfall-across-andhra-pradesh-imd/articleshow/125674336.cms",
        "description": "Cyclone Ditwah is set to bring increased rainfall to many Andhra Pradesh districts. North Coastal Andhra Pradesh and Yanam will see light to moderate rain with strong winds. South Coastal Andhra Pradesh and Rayalaseema face heavy to very heavy downpours. Offi…",
        "published_at": "2025-11-30T14:07:03Z"
      },
      {
        "source": "Biztoc.com",
        "title": "Death toll hits 212 as Sri Lanka struggles with Cyclone Ditwah impact",
        "url": "https://biztoc.com/x/6c861a467d0a9c79",
        "description": "",
        "published_at": "2025-11-30T13:59:04Z"
      },
      {
        "source": "The Times of India",
        "title": "Urgent need to transform public perception of police: PM Modi at DGPs' conference",
        "url": "https://economictimes.indiatimes.com/news/india/urgent-need-to-transform-public-perception-of-police-pm-modi-at-dgps-conference/articleshow/125674224.cms",
        "description": "Prime Minister Modi urged police to enhance professionalism and sensitivity, especially for youth, at the DGP conference. He stressed integrating technology for intelligence, strengthening urban and tourist policing, and tackling drug abuse with a unified app…",
        "published_at": "2025-11-30T13:56:29Z"
      },
      {
        "source": "CBC News",
        "title": "Indonesian residents hunt for food and water after deadly floods; 193 dead in Sri Lanka",
        "url": "https://www.cbc.ca/news/world/death-tolls-rise-in-indonesia-sri-lanka-flooding-9.6997892",
        "description": "Some residents of thexa0flood-hit Indonesian island of Sumatraxa0have resorted to stealing food and water to survive, authorities said Sunday, while Sri Lankan officials said deaths from floods and mudslides in that island nation have risen to 193.",
        "published_at": "2025-11-30T13:49:43Z"
      },
      {
        "source": "Slashdot.org",
        "title": "Sri Lanka: Dozens dead as cyclone Ditwah hits country - DW",
        "url": "https://slashdot.org/firehose.pl?op=view&amp;id=180243285",
        "description": "Sri Lanka: Dozens dead as cyclone Ditwah hits countryDW At least 193 dead in Sri Lanka flood, with many more missingBBC Sri Lanka declares emergency as floods wreak havoc across ColomboAl Jazeera As Cyclone Deaths Pass 150, Sri Lanka Is Overwhelmed by Rescue …",
        "published_at": "2025-11-30T13:32:09Z"
      },
      {
        "source": "The Times of India",
        "title": "Cyclone Ditwah: 400 Indian passengers stranded due to disaster evacuated from Sri Lanka",
        "url": "https://economictimes.indiatimes.com/news/india/cyclone-ditwah-400-indian-passengers-stranded-due-to-disaster-evacuated-from-sri-lanka/articleshow/125673667.cms",
        "description": "Over 400 Indian nationals stranded in Sri Lanka following cyclone Ditwah returned home on Sunday. Flights C130 and IL 76 carried them to Delhi and Trivandrum respectively. These aircraft had previously delivered aid to Sri Lanka. The Indian High Commission fa…",
        "published_at": "2025-11-30T13:12:30Z"
      },
      {
        "source": "BusinessLine",
        "title": "Andhra Pradesh to see intense rainfall as Cyclone Ditwah moves along north Tamil Nadu coast: IMD",
        "url": "https://www.thehindubusinessline.com/news/andhra-pradesh-to-see-intense-rainfall-as-cyclone-ditwah-moves-along-north-tamil-nadu-coast-imd/article70341882.ece",
        "description": "Cyclone Ditwah is set to bring intense rainfall to Andhra Pradesh, with officials on high alert for severe weather conditions.",
        "published_at": "2025-11-30T12:53:17Z"
      },
      {
        "source": "Al Jazeera English",
        "title": "Sri Lanka declares emergency as floods wreak havoc across Colombo",
        "url": "https://www.aljazeera.com/gallery/2025/11/30/sri-lanka-declares-emergency-as-floods-wreak-havoc-across-colombo",
        "description": "More than 25,000 homes destroyed, 147,000 displaced, in Sri Lanka's deadliest flood since 2017, affecting Colombo.",
        "published_at": "2025-11-30T12:11:41Z"
      },
      {
        "source": "RTE",
        "title": "Tropical storm deaths cross 500 in Southeast Asia",
        "url": "https://www.rte.ie/news/asia/2025/1130/1546567-southeast-asia-floods/",
        "description": "The death toll mounted to over 500 from floods and landslides caused by torrential rains across three countries in Southeast Asia, officials said, as relief efforts for tens of thousands of displaced people continued over the weekend.",
        "published_at": "2025-11-30T10:08:49Z"
      },
      {
        "source": "BusinessLine",
        "title": "Cyclone Ditwah: DoT launches 24x7 connectivity control room to safeguard network connectivity",
        "url": "https://www.thehindubusinessline.com/news/cyclone-ditwah-dot-launches-24x7-connectivity-control-room-to-safeguard-network-connectivity/article70341541.ece",
        "description": "DoT establishes 24/7 control room to ensure telecom connectivity and resilience amid Cyclone Ditwah's impact on coastal regions.",
        "published_at": "2025-11-30T10:00:08Z"
      },
      {
        "source": "Sky.com",
        "title": "More than 600 dead in Indonesia and Thailand after floods and landslides",
        "url": "https://news.sky.com/story/more-than-600-dead-in-indonesia-and-thailand-after-floods-and-landslides-and-sri-lanka-reporting-more-than-200-deaths-from-cyclone-13477400",
        "description": "The death toll following flooding and landslides in Indonesia and Thailand has risen to more than 600 - with nearby Sri Lanka also reporting more than 200 deaths after a cyclone.",
        "published_at": "2025-11-30T09:45:00Z"
      },
      {
        "source": "The Times of India",
        "title": "Harvard doctor shares seven superfoods to get rid of dangerous visceral fat naturally: Check how to burn belly fat",
        "url": "https://economictimes.indiatimes.com/news/new-updates/harvard-doctor-shares-seven-superfoods-to-get-rid-of-dangerous-visceral-fat-naturally-check-how-to-burn-belly-fat/articleshow/125670973.cms",
        "description": "Tips to lose visceral fat: A gastroenterologist highlights seven nutrient-rich foods to combat dangerous visceral fat, which accumulates around organs and disrupts metabolism. Dr. Saurabh Sethi recommends incorporating blueberries, Greek yogurt, fatty fish, o…",
        "published_at": "2025-11-30T09:44:32Z"
      },
      {
        "source": "The Times of India",
        "title": "Telecom dept sets up 24X7 control room to safeguard network connectivity during cyclone Ditwah threat",
        "url": "https://economictimes.indiatimes.com/news/india/telecom-dept-sets-up-24x7-control-room-to-safeguard-network-connectivity-during-cyclone-ditwah-threat/articleshow/125670928.cms",
        "description": "The Department of Telecom is taking extensive measures to ensure communication networks remain resilient. A 24x7 control room is operational. Intra Circle Roaming and Cell Broadcast testing are complete. Telecom operators must ensure uninterrupted operations,…",
        "published_at": "2025-11-30T09:22:28Z"
      },
      {
        "source": "BusinessLine",
        "title": "Op Sagar Bandhu: Another C-130J deployed, Mi-17 helicopters positioned in Colombo",
        "url": "https://www.thehindubusinessline.com/news/world/op-sagar-bandhu-another-c-130j-deployed-mi-17-helicopters-positioned-in-colombo/article70341440.ece",
        "description": "The aircraft, carrying equipment meant for a National Disaster Relief Force (NDRF) team deployed as part of Operation Sagar Bandhu, landed in Colombo on Sunday",
        "published_at": "2025-11-30T09:08:24Z"
      },
      {
        "source": "The Times of India",
        "title": "Actor Umesh's cause of death revealed: Veteran Kannada star dies at 80. Here's what really happened",
        "url": "https://economictimes.indiatimes.com/news/new-updates/actor-umeshs-cause-of-death-revealed-veteran-kannada-star-dies-at-80-heres-what-really-happened/articleshow/125670199.cms",
        "description": "Veteran Kannada actor 'Mysore' Srikantayya Umesh passed away at 80 after a battle with stage-four liver cancer. Known for his comedic roles and a career spanning over five decades and 350 films, Umesh's unwavering optimism even in his final days touched many.…",
        "published_at": "2025-11-30T07:58:15Z"
      },
      {
        "source": "Al Jazeera English",
        "title": "‘Neighbourhoods buried under mud’: Sri Lanka floods death toll rises to 159",
        "url": "https://www.aljazeera.com/news/2025/11/30/neighbourhoods-buried-under-mud-sri-lanka-floods-death-toll-rises-to-159",
        "description": "President Anura Kumara Dissanayake declares a state of emergency to deal with the aftermath of Cyclone Ditwah.",
        "published_at": "2025-11-30T07:30:33Z"
      },
      {
        "source": "Hurriyet Daily News",
        "title": "Floods hit Sri Lanka's capital as cyclone death toll rises to 159",
        "url": "https://www.hurriyetdailynews.com/floods-hit-sri-lankas-capital-as-cyclone-death-toll-rises-to-159-216265",
        "description": "Sri Lankan authorities battled rising floodwaters in parts of the capital on Sunday after a powerful cyclone left a trail of destruction, killing at least 159 people across the country.",
        "published_at": "2025-11-30T06:58:44Z"
      },
      {
        "source": "Ndtvprofit.com",
        "title": "Cyclone Ditwah Continues To Bring More Rains To TN And Puducherry",
        "url": "https://www.ndtvprofit.com/nation/cyclone-ditwah-continues-to-bring-more-rains-to-tn-and-puducherry",
        "description": "Rains triggered by Cyclone Ditwah continued in several parts of Tamil Nadu as it is expected to move parallel to the coastline of northern parts of the state and neighbouring Puducherry in the next 24 hours, the weather office said on Sunday.",
        "published_at": "2025-11-30T06:27:33Z"
      },
      {
        "source": "The Times of India",
        "title": "Mokshada Ekadashi 2025: Date, Parana Time, Puja Rituals and Significance",
        "url": "https://timesofindia.indiatimes.com/religion/rituals-puja/mokshada-ekadashi-2025-date-parana-time-puja-rituals-and-significance/articleshow/125661186.cms",
        "description": "Mokshada Ekadashi, a significant day for worshipping Lord Vishnu, will be observed on December 1, 2025. Devotees undertake strict fasts and prayers to attain salvation and be freed from the cycle of birth and death. The rituals involve bathing idols, offering…",
        "published_at": "2025-11-30T05:34:47Z"
      },
      {
        "source": "The Times of India",
        "title": "Veteran Kannada actor Umesh passes away at 80 after battling liver cancer",
        "url": "https://timesofindia.indiatimes.com/tv/news/kannada/veteran-kannada-actor-umesh-passes-away-at-80-after-battling-liver-cancer/articleshow/125669003.cms",
        "description": "Veteran Kannada actor Umesh, known for his over six-decade career and hundreds of films and Television shows, passed away at 80 in Bengaluru. He was undergoing treatment for advanced-stage liver cancer following a fall that caused a head injury. Despite his i…",
        "published_at": "2025-11-30T05:27:43Z"
      },
      {
        "source": "The Times of India",
        "title": "ONGC Apprentices Recruitment 2025: Registration ends today for 2,623 posts, check how to apply here",
        "url": "https://timesofindia.indiatimes.com/education/news/ongc-apprentices-recruitment-2025-registration-ends-today-for-2623-posts-check-how-to-apply-here/articleshow/125669012.cms",
        "description": "ONGC's 2025 Apprentice recruitment drive, offering 2,623 positions for Class 10, ITI, Diploma, and Graduate candidates, closes registration today. Selection is merit-based on qualifying exam marks, followed by document verification and medical fitness. The 12…",
        "published_at": "2025-11-30T05:23:07Z"
      },
      {
        "source": "BusinessLine",
        "title": "Cyclone Ditwah begins to weaken off TN-Puducherry coast",
        "url": "https://www.thehindubusinessline.com/economy/agri-business/cyclone-ditwah-begins-to-weaken-off-tn-puducherry-coast/article70341065.ece",
        "description": "Extremely heavy rainfall likely at isolated places over north coastal Tamil Nadu and Puducherry today",
        "published_at": "2025-11-30T05:19:55Z"
      },
      {
        "source": "CNA",
        "title": "Floods hit Sri Lanka's capital as cyclone death toll rises to 159",
        "url": "https://www.channelnewsasia.com/asia/sri-lanka-cyclone-floods-159-dead-5497956",
        "description": "Another 203 people are missing, the Disaster Management Centre said.xa0President Anura Kumara Dissanayake declared a state of emergency on Saturday (Nov 29).",
        "published_at": "2025-11-30T05:17:47Z"
      },
      {
        "source": "The Times of India",
        "title": "Nikhil Kamath drops another teaser of podcast with Elon Musk, Tesla CEO says 'Honestly sometimes I wonder...'",
        "url": "https://economictimes.indiatimes.com/news/new-updates/nikhil-kamath-drops-another-teaser-of-podcast-with-elon-musk-tesla-ceo-says-honestly-sometimes-i-wonder-/articleshow/125668916.cms",
        "description": "Zerodha co-founder Nikhil Kamath has dropped another teaser of his upcoming podcast with world's richest man, Elon Musk. In the 39-second black and white clip, Nikhil asks the Tesla CEO that why he is so obsessed with the letter X. Last week, Nikhil Kamath dr…",
        "published_at": "2025-11-30T05:15:07Z"
      },
      {
        "source": "The Times of India",
        "title": "Sri Lanka's capital hit by floods as cyclone death toll rises to 159",
        "url": "https://economictimes.indiatimes.com/news/international/world-news/sri-lankas-capital-hit-by-floods-as-cyclone-death-toll-rises-to-159/articleshow/125668934.cms",
        "description": "Cyclone Ditwah has devastated Sri Lanka.  Flooding is severe in Colombo, with the Kelani River overflowing.  Over 150 lives are lost and many are missing.  Thousands of homes are destroyed, and over a hundred thousand people are in shelters.  The nation faces…",
        "published_at": "2025-11-30T05:13:52Z"
      },
      {
        "source": "BusinessLine",
        "title": "Cyclone Ditwah continues to bring more rains to TN and Puducherry",
        "url": "https://www.thehindubusinessline.com/news/cyclone-ditwah-continues-to-bring-more-rains-to-tn-and-puducherry/article70341044.ece",
        "description": "Rains triggered by Cyclone Ditwah continued in several parts of Tamil Nadu as it is expected to move parallel to the coastline of northern parts of the state and neighbouring Puducherry in the next 24 hours, the weather office said on Sunday.",
        "published_at": "2025-11-30T05:11:59Z"
      },
      {
        "source": "The Times of India",
        "title": "'Defamed, mistreated': Mother of pan masala baron's daughter-in-law who died by 'suicide' in South Delhi levels serious allegations against in-laws",
        "url": "https://economictimes.indiatimes.com/news/india/defamed-mistreated-mother-of-pan-masala-barons-daughter-in-law-who-died-by-suicide-in-south-delhi-levels-serious-allegations-against-in-laws/articleshow/125668519.cms",
        "description": "Deepti Chaurasia's mother has accused her husband and in-laws of harassment and domestic violence. Deepti, daughter-in-law of a pan masala baron, was found hanging at her Delhi residence. Her mother's complaint led to an FIR against her husband and mother-in-…",
        "published_at": "2025-11-30T04:26:18Z"
      },
      {
        "source": "BusinessLine",
        "title": "Kerala CM writes to Jaishankar offering support for Indians stranded at Colombo airport",
        "url": "https://www.thehindubusinessline.com/news/kerala-cm-writes-to-jaishankar-offering-support-for-indians-stranded-at-colombo-airport/article70340986.ece",
        "description": "\\',",
        "Jaishankar.'": "published_at\": \"2025-11-30T04:22:43Z"
      },
      {
        "source": "BusinessLine",
        "title": "Cyclone Ditwah: Ashwini Vaishnaw evaluates railway preparedness",
        "url": "https://www.thehindubusinessline.com/news/cyclone-ditwah-ashwini-vaishnaw-evaluates-railway-preparedness/article70340981.ece",
        "description": "Railway Minister Ashwini Vaishnaw reviews Cyclone Ditwah preparedness to ensure passenger safety and minimize service disruptions in Tamil Nadu.",
        "published_at": "2025-11-30T04:12:54Z"
      },
      {
        "source": "BusinessLine",
        "title": "Cyclone Ditwah: IMD issues yellow alert across various districts of Tamil Nadu, Puducherry for next 3 hours",
        "url": "https://www.thehindubusinessline.com/news/cyclone-ditwah-imd-issues-yellow-alert-across-various-districts-of-tamil-nadu-puducherry-for-next-3-hours/article70340975.ece",
        "description": "Red alert has also been issued in some districts of Tamil Nadu and an orange alert for heavy rainfall accompanied by thunder and lightning",
        "published_at": "2025-11-30T04:12:18Z"
      },
      {
        "source": "The Times of India",
        "title": "Cyclone Ditwah nears Tamil Nadu coast, 54 flights cancelled at Chennai airport: 10 points",
        "url": "https://economictimes.indiatimes.com/news/india/cyclone-ditwah-nears-tamil-nadu-coast-54-flights-cancelled-at-chennai-airport-10-points/articleshow/125668283.cms",
        "description": "Cyclone Ditwah is influencing east coast weather, prompting a yellow alert for Tamil Nadu and Puducherry, including Chennai. As many as 54 flights have been cancelled at the Chennai Airport with Air India issuing an advisory for passengers. The IMD has warned…",
        "published_at": "2025-11-30T04:09:13Z"
      },
      {
        "source": "Economictimes.com",
        "title": "Cyclone Ditwah Tracker Live Updates: No landfall expected, but heavy rain alert remains in place for Tamil Nadu",
        "url": "https://m.economictimes.com/news/newsblogs/cyclone-ditwah-tracker-live-update-imd-heavy-rainfall-alert-cyclone-chennai-tamil-nadu-puducherry/liveblog/125668305.cms",
        "description": "Even though Cyclone Ditwah will not make landfall, Tamil Nadu is still set to face heavy rain. Weather officials say the system will stay over the sea but continue to push moisture towards the state, leading to strong winds and intense showers across several …",
        "published_at": "2025-11-30T04:06:32Z"
      },
      {
        "source": "Ndtvprofit.com",
        "title": "Cyclone Kills 132 In Sri Lanka's Worst Flood For 20 Years",
        "url": "https://www.ndtvprofit.com/world/cyclone-kills-132-in-sri-lankas-worst-flood-for-20-years",
        "description": "Cyclone Ditwah killed 132 people across Sri Lanka, with another 176 missing, according to the Disaster Management Centre, as torrential rains caused the country’s worst flooding in over two decades.",
        "published_at": "2025-11-30T03:57:25Z"
      },
      {
        "source": "Khabarhub.com",
        "title": "Cyclone ‘Ditwah’ in Bay of Bengal partially affects Nepal",
        "url": "https://english.khabarhub.com/2025/30/509388/",
        "description": "KATHMANDU: Cyclone ‘Ditwah’, which developed in the southwest Bay of Bengal, is currently having a partial impact on Nepal, according to the Weather Forecast Division. The Division’s bulletin today states that the weather is mainly clear in Koshi, Madhes, Bag…",
        "published_at": "2025-11-30T03:45:34Z"
      },
      {
        "source": "The Times of India",
        "title": "Baba Vanga's chilling world changing predictions for 2026: From aliens on earth to AI U-turn",
        "url": "https://economictimes.indiatimes.com/news/new-updates/baba-vangas-chilling-world-changing-predictions-for-2026-from-aliens-on-earth-to-ai-u-turn/articleshow/125668075.cms",
        "description": "With 2025 coming to an end, Baba Vanga's chilling predictions for 2026 have re-surfaced on social media and have sparked massive curiosity among people. Reports claim she even supposedly forecasted the 9/11 attacks and the 2022 UK floods. As for the year 2026…",
        "published_at": "2025-11-30T03:24:44Z"
      },
      {
        "source": "The Times of India",
        "title": "Cyclone Ditwah tracker: Where is cyclone Ditwah and when will it make landfall? IMD warns of heavy rain in Andhra, Tamil Nadu and other states",
        "url": "https://economictimes.indiatimes.com/news/new-updates/cyclone-ditwah-tracker-where-is-cyclone-ditwah-and-when-will-it-make-landfall-imd-warns-of-heavy-rain-in-andhra-tamil-nadu-and-other-states/articleshow/125667773.cms",
        "description": "Cyclone Ditwah live tracker: The IMD in its latest weather bulletin said the cyclonic storm 'Ditwah' will track nearly northwards, moving parallel to the Tamil Nadu–Puducherry coastline over the next 24 hours. Ditwah is expected to make landfall on November 3…",
        "published_at": "2025-11-30T02:34:04Z"
      },
      {
        "source": "BBC News",
        "title": "Sri Lanka flood death toll rises to 159, many more missing",
        "url": "https://www.bbc.com/news/articles/c5yq26x0dd6o",
        "description": "A state of emergency is announced as Sri Lanka grapples with its worst weather disaster in years.",
        "published_at": "2025-11-30T02:16:41Z"
      },
      {
        "source": "The Times of India",
        "title": "Chennai rain alert: Chennai schools to remain shut on December 1 due to cyclone 'Ditwah' impact? What IMD said in its latest weather update",
        "url": "https://economictimes.indiatimes.com/news/new-updates/chennai-rain-alert-chennai-schools-to-remain-shut-on-december-1-due-to-cyclone-ditwah-impact-what-imd-said-in-its-latest-weather-update/articleshow/125667658.cms",
        "description": "Chennai weather: Chennai and other districts of Tamil Nadu are expected to receive extremely heavy rainfall as cyclone Ditwah heads towards Tamil Nadu-Puducherry coast. Schools in various districts of Tamil Nadu were shut on Saturday but there is no official …",
        "published_at": "2025-11-30T01:59:52Z"
      },
      {
        "source": "The Times of India",
        "title": "Ashwini Vaishnaw reviews railways' preparedness to ensure passenger safety, minimise disruptions in wake of cyclone Ditwah",
        "url": "https://economictimes.indiatimes.com/news/india/ashwini-vaishnaw-reviews-railways-preparedness-to-ensure-passenger-safety-minimise-disruptions-in-wake-of-cyclone-ditwah/articleshow/125667664.cms",
        "description": "With Cyclone Ditwah looming over Tamil Nadu, Union Minister Ashwini Vaishnaw took the initiative to check on railway safety measures. The India Meteorological Department has raised a red flag, warning of severe weather for northern Tamil Nadu, Puducherry, and…",
        "published_at": "2025-11-30T01:56:45Z"
      },
      {
        "source": "ABC News (AU)",
        "title": "Rescue efforts underway after flash floods kill hundreds in Indonesia",
        "url": "https://www.abc.net.au/news/2025-11-30/indonesia-flood-death-toll-climbs-amid-cyclone-devastation/106083102",
        "description": "Torrential rain causes flash floods and landslides in Indonesia, where the toll rises as authorities mount rescue operations.",
        "published_at": ""
      }
    ]
  }
}