{
  "Mamdani as new york mayor": {
    "timestamp": "2025-11-23T00:27:34.616302",
    "articles": [
      {
        "source": "Fox News",
        "title": "Mamdani dodges question on socialism vote ahead of high-stakes meeting with Trump",
        "url": "https://www.foxnews.com/politics/mamdani-dodges-question-socialism-vote-ahead-high-stakes-meeting-trump",
        "description": "NYC mayor-elect Mamdani dodged questions about a House vote condemning socialism just hours before his scheduled White House meeting with President Trump.",
        "published_at": "2025-11-21T18:48:31Z"
      },
      {
        "source": "Freerepublic.com",
        "title": "Mamdani's Numbnut Voters: Lenin purportedly said that it only took “four years” to plant the seed that would never be uprooted",
        "url": "https://freerepublic.com/focus/f-news/4353870/posts",
        "description": "“Numbnut” is derogatory American slang, sometimes used for humor, to mean a “slow-witted, unresponsive, or inept person.” But no humor exists in the fact New York City (NYC) voters, always on the edge of numbnut-osity, went over it by electing socialist/commu…",
        "published_at": "2025-11-21T18:18:13Z"
      },
      {
        "source": "Wnd.com",
        "title": "Disturbing math: Nearly 100 Democrats refuse to vote to condemn socialism",
        "url": "https://www.wnd.com/2025/11/disturbing-math-nearly-100-democrats-refuse-vote-condemn/",
        "description": "'There is nothing controversial about denouncing a poisonous, failed, and deadly ideology'",
        "published_at": "2025-11-21T17:43:40Z"
      },
      {
        "source": "The Daily Caller",
        "title": "Islam Won’t Engulf America. The Real Dystopia Awaits In The Not-So-Distant Future",
        "url": "https://dailycaller.com/2025/11/21/dearborn-michigan-islam-america-new-york-city-rural-urban-divide-protests/",
        "description": "Cities will be much more blue; rural counties will be more red. There will be no national unity and American pride; we will all splinter off into city-states.",
        "published_at": "2025-11-21T17:42:57Z"
      },
      {
        "source": "Memeorandum.com",
        "title": "House passes resolution condemning socialism as Zohran Mamdani arrives for Trump meeting (Josh Christenson/New York Post)",
        "url": "https://www.memeorandum.com/251121/p67",
        "description": "Josh Christenson / New York Post:\nHouse passes resolution condemning socialism as Zohran Mamdani arrives for Trump meetingxa0 —xa0 WASHINGTON — The House passed a resolution denouncing the “horrors of socialism” Friday, hours before Democratic socialist New York …",
        "published_at": "2025-11-21T17:40:00Z"
      },
      {
        "source": "TheBlaze",
        "title": "Trump warns Mamdani ahead of high-stakes Oval Office meeting: 'He has to be careful'",
        "url": "https://www.theblaze.com/news/trump-warns-mamdani-ahead-of-high-stakes-oval-office-meeting-he-has-to-be-careful",
        "description": "President Donald Trump has offered a preview of his highly anticipated meeting with New York City's newly elected socialist mayor. Trump's meeting with Mayor-elect Zohran Mamdani (D) in the Oval Office Friday afternoon is proving to be one of the most highly …",
        "published_at": "2025-11-21T17:25:00Z"
      },
      {
        "source": "Freerepublic.com",
        "title": "Time To Fight for New York",
        "url": "https://freerepublic.com/focus/f-news/4353853/posts",
        "description": "Zohran Mamdani may have eked out his victory in New York City’s mayoral contest – prompting a literal champagne socialist celebration in some fancy restaurants – but a lot of New Yorkers are far from happy about it. While Mamdani fell short of the two-thirds …",
        "published_at": "2025-11-21T17:23:56Z"
      },
      {
        "source": "Boston Herald",
        "title": "Latino US citizens racially profiled by federal immigration agents in Chicago: ‘I felt like a piece of trash’",
        "url": "https://www.bostonherald.com/2025/11/21/latino-us-citizens-racially-profiled-immigration-chicago/",
        "description": "The Tribune spoke to U.S. citizens and green card holders who have either been questioned or detained during Trump’s Operation Midway Blitz.",
        "published_at": "2025-11-21T17:13:13Z"
      },
      {
        "source": "The Irish Times",
        "title": "Donald Trump and Zohran Mamdani to have first face-to-face meeting at the White House",
        "url": "https://www.irishtimes.com/world/us/2025/11/21/donald-trump-and-zohran-mamdani-to-have-first-face-to-face-meeting-at-the-white-house/",
        "description": "Encounter comes after Trump recently called Mamdani a ‘communist lunatic’",
        "published_at": "2025-11-21T17:09:53Z"
      },
      {
        "source": "The Cut",
        "title": "Zohran Is on His Way to Meet Trump",
        "url": "http://www.thecut.com/article/trump-mamdani-meeting.html",
        "description": "“I will work with him on any agenda that benefits New Yorkers,” Mamdani said of the president, who’s described him as “bad news” and a “total nutjob.”",
        "published_at": "2025-11-21T16:47:25Z"
      },
      {
        "source": "Biztoc.com",
        "title": "Full List of Democrats Voting to Condemn Socialism as Mamdani Comes to Town",
        "url": "https://biztoc.com/x/025c170f0152e49a",
        "description": "Dozens of Democrats voted to condemn socialism on Friday ahead of the meeting between President Donald Trump and New York City Mayor-elect Zohran Mamdani.\nWhy It Matters\nMamdani became one of the most prominent democratic socialists in the country after his v…",
        "published_at": "2025-11-21T16:29:23Z"
      },
      {
        "source": "Freerepublic.com",
        "title": "House Of Representatives Humiliates Mamdani Ahead Of White House Visit",
        "url": "https://freerepublic.com/focus/f-chat/4353836/posts",
        "description": "The House voted 285-98 on Friday to denounce the “horrors of socialism,” a sharp rebuke delivered just hours before President Donald Trump sits down with New York’s incoming democratic socialist mayor, Zohran Mamdani. Eighty-six Democrats crossed the aisle to…",
        "published_at": "2025-11-21T16:22:03Z"
      },
      {
        "source": "The Daily Caller",
        "title": "Nearly 100 Democrats Refuse To Condemn Socialism In Party-Shattering Vote",
        "url": "https://dailycaller.com/2025/11/21/democrats-split-house-resolution-condemn-socialism/",
        "description": "The House of Representatives approved a resolution condemning socialism Friday morning in a vote that sharply divided Democratic lawmakers.",
        "published_at": "2025-11-21T16:19:15Z"
      },
      {
        "source": "New York Post",
        "title": "House passes resolution condemning socialism as Zohran Mamdani arrives for Trump meeting",
        "url": "https://nypost.com/2025/11/21/us-news/house-passes-resolution-condemning-socialism-as-zohran-mamdani-arrives-for-trump-meeting/",
        "description": "The vote took place shortly after Mamdani touched down at Ronald Reagan Washington National Airport ahead of the scheduled 3 p.m. sitdown with the president.",
        "published_at": "2025-11-21T16:14:54Z"
      },
      {
        "source": "CBS News",
        "title": "What to expect as Trump prepares to meet NYC Mayor-elect Mamdani",
        "url": "https://www.cbsnews.com/video/what-to-expect-as-trump-prepares-to-meet-nyc-mayor-elect-mamdani/",
        "description": "President Trump is meeting with New York City Mayor-elect Zohran Mamdani at the White House on Friday after a tense election. CBS News' Ed O'Keefe reports.",
        "published_at": "2025-11-21T16:12:00Z"
      },
      {
        "source": "Fox News",
        "title": "86 Dems vote with Republicans to condemn socialism in wake of Mamdani's mayoral victory",
        "url": "https://www.foxnews.com/politics/86-dems-republicans-condemn-socialism-wake-mamdanis-mayoral-victory",
        "description": "The House voted along bipartisan lines to condemn socialism in a resolution highlighting the ideology's historical failures.",
        "published_at": "2025-11-21T16:00:11Z"
      },
      {
        "source": "New York Post",
        "title": "Starbucks barista strike expands nationwide days after NYC Mayor-elect Zohran Mamdani’s boycott call",
        "url": "https://nypost.com/2025/11/21/business/starbucks-barista-strike-expand-after-nyc-mayor-elect-zohran-mamdanis-boycott-call/",
        "description": "A New York beanery joined the labor stoppage that has so far impacted more than two dozen locations.",
        "published_at": "2025-11-21T15:58:24Z"
      },
      {
        "source": "Biztoc.com",
        "title": "Trump and Mamdani are meeting for the first time today. What to know",
        "url": "https://biztoc.com/x/60556be156f3fff3",
        "description": "President Donald Trump has called New York City’s Mayor-elect Zohran Mamdani a “100% Communist Lunatic” and a “total nut job.” Mamdani has called Trump’s administration “authoritarian” and described himself as “Donald Trump’s worst nightmare.”\nSo their first-…",
        "published_at": "2025-11-21T15:55:22Z"
      },
      {
        "source": "Moonbattery.com",
        "title": "Islamic Terror Supporters Besiege New York City Synagogue",
        "url": "https://moonbattery.com/islamic-terror-supporters-besiege-new-york-city-synagogue/",
        "description": "Zohran Mamdani has not yet taken power in New York, but already we read this: Hundreds of pro-Palestinian activists besieged Manhattan’s prestigious Park East Synagogue on Wednesday night, chanting, “Globalize the intifada,” “Death to the IDF,” and “take anot…",
        "published_at": "2025-11-21T15:42:47Z"
      },
      {
        "source": "Fox News",
        "title": "Trump flips Dems' 'affordability' script, turning buzzword into MAGA material as Mamdani visit looms",
        "url": "https://www.foxnews.com/politics/trump-flips-dems-affordability-script-turning-buzzword-maga-material-mamdani-visit-looms",
        "description": "Democrats pivot to affordability messaging in 2025 campaigns while Trump attacks their economic record and promotes his own cost-cutting initiatives.",
        "published_at": "2025-11-21T15:39:37Z"
      },
      {
        "source": "Mondoweiss",
        "title": "How Zohran Mamdani’s mayoral win in NYC could impact national politics",
        "url": "https://mondoweiss.net/2025/11/how-zohran-mamdanis-mayoral-win-in-nyc-could-impact-national-politics/",
        "description": "Mondoweiss interviews political consultant Peter Feld about how Zohran Mamdani’s historic win will impact beyond New York and how the Israel lobby will respond.",
        "published_at": "2025-11-21T15:30:00Z"
      },
      {
        "source": "IndieWire",
        "title": "The Best TV from November — New Shows, Great Finales, and Hidden Gems",
        "url": "https://www.indiewire.com/lists/best-tv-shows-november-new-series-what-to-watch/",
        "description": "Get in on the ground floor of \"Pluribus,\" get to know our best forgotten president, and get down with \"The Lowdown\" — all available now and all among the best TV November had to offer.",
        "published_at": "2025-11-21T15:00:00Z"
      },
      {
        "source": "BBC News",
        "title": "Zelensky says Ukraine risks losing US as key partner over White House plan to end Russia's war",
        "url": "https://www.bbc.co.uk/news/live/c6257wrx301t",
        "description": "Trump says it's \"appropriate\" to give Ukraine until Thanksgiving to agree to a peace deal, while Moscow says it's yet to receive anything official from the US.",
        "published_at": "2025-11-21T14:52:35Z"
      },
      {
        "source": "Fox News",
        "title": "Mamdani struggles to explain how he'll fund free buses",
        "url": "https://www.foxnews.com/politics/mamdani-struggles-explain-how-hell-fund-free-buses",
        "description": "Zohran Mamdani, who is slated to become New York City mayor, faces the practical question of how to secure funding to make bus rides free.",
        "published_at": "2025-11-21T14:48:52Z"
      },
      {
        "source": "Boston Herald",
        "title": "Trump and Mamdani meet Friday in the Oval Office. They’ve cast each other as adversaries for months",
        "url": "https://www.bostonherald.com/2025/11/21/trump-mamdani-meeting-white-house/",
        "description": "The Republican president and the new Democratic star also have indicated an openness to finding areas of agreement.",
        "published_at": "2025-11-21T14:01:13Z"
      },
      {
        "source": "CBS News",
        "title": "Mamdani set to meet with President Trump at White House today",
        "url": "https://www.cbsnews.com/newyork/news/zohran-mamdani-president-trump-white-house-meeting-today/",
        "description": "New York City Mayor-elect Zohran Mamdani is set to meet with President Trump on Friday afternoon, where he plans to discuss affordabilityu200b.",
        "published_at": "2025-11-21T13:47:00Z"
      },
      {
        "source": "Whyevolutionistrue.com",
        "title": "Friday: Hili dialogue",
        "url": "https://whyevolutionistrue.com/2025/11/21/friday-hili-dialogue-551/",
        "description": "Welcome to the end of the “work” week and, at sundown, the beginning of shabbos for Jewish cats. It’s November 21, 2025 and National Gingerbread Cookie Day.xa0 They are a big deal in Poland, and come highly decorated—like these I photographed in Katowice last D…",
        "published_at": "2025-11-21T12:45:29Z"
      },
      {
        "source": "Fox News",
        "title": "DAVID MARCUS: Mr. Mamdani goes to Washington between rock and hard place",
        "url": "https://www.foxnews.com/opinion/david-marcus-mr-mamdani-goes-washington-between-rock-hard-place",
        "description": "NYC's socialist mayor-elect Zohran Mamdani heads to Trump's White House home for a high-stakes political meeting that could define his early tenure.",
        "published_at": "2025-11-21T12:31:22Z"
      },
      {
        "source": "RTE",
        "title": "Trump to meet incoming New York mayor Zohran Mamdani",
        "url": "https://www.rte.ie/news/world/2025/1121/1545169-trump-mamdani-meeting/",
        "description": "US President Donald Trump will meet with incoming New York mayor Zohran Mamdani today, the first in-person talks between political opposites who have clashed over everything from immigration to economic policy.",
        "published_at": "2025-11-21T12:31:03Z"
      },
      {
        "source": "NPR",
        "title": "CDC claims vaccines may cause autism. And, Trump and Mamdani to meet today",
        "url": "https://www.npr.org/2025/11/21/g-s1-98712/up-first-newsletter-cdc-vaccine-autism-trump-ukraine-peace-mamdani",
        "description": "The CDC claims, without evidence, that vaccines may cause autism. And, New York City mayor-elect Zohran Mamdani heads to the White House, where he will meet the president for the first time.",
        "published_at": "2025-11-21T12:16:25Z"
      },
      {
        "source": "NBC News",
        "title": "The high stakes Mamdani-Trump meeting and where the drug boats are really going: Morning Rundown",
        "url": "https://www.nbcnews.com/news/us-news/high-stakes-mamdani-trump-meeting-drug-boats-are-really-going-morning-rcna245089",
        "description": "Mamdani and Trump finally come face-to-face after the president's threats to pull federal funding for New York City.",
        "published_at": "2025-11-21T12:06:29Z"
      },
      {
        "source": "ABC News",
        "title": "Trump, Mamdani to meet in Oval Office as mayor-elect pushes affordability agenda",
        "url": "https://abcnews.go.com/Politics/trump-mamdani-meet-oval-office-mayor-elect-pushes/story?id=127715736",
        "description": "New York City Mayor-elect Zohran Mamdani is scheduled to meet President Donald Trump for the first time Friday.",
        "published_at": "2025-11-21T11:27:51Z"
      },
      {
        "source": "CBS News",
        "title": "What Trump and Mamdani have said about each other",
        "url": "https://www.cbsnews.com/news/trump-zohran-mamdani-comments-about-each-other/",
        "description": "President Trump has called Zohran Mamdani \"my little communist mayor.\" Mamdani has vowed to \"Trump-proof\" New York City. Today they meet at the White House.",
        "published_at": "2025-11-21T11:00:12Z"
      },
      {
        "source": "The New Republic",
        "title": "Donald Trump Is a Lame Duck Now",
        "url": "https://newrepublic.com/article/203484/trump-lame-duck-approval-rating-polls-zohran-mamdani",
        "description": "All of a sudden, Donald Trump can’t catch a break. November has been a month of humiliations and stinging defeats for a president who, not so long ago, carried himself like an emperor who was universally adored and beyond reproach.xa0In retrospect, we may look …",
        "published_at": "2025-11-21T11:00:00Z"
      },
      {
        "source": "Fox News",
        "title": "House GOP campaign chair wants Trump 'out there on the trail' in midterm battle for majority",
        "url": "https://www.foxnews.com/politics/house-gop-campaign-chair-wants-trump-out-trail-midterm-battle-majority",
        "description": "GOP campaign chair calls Democratic 2025 election wins a \"wake up call\" for Republican voters ahead of crucial 2026 midterm elections and party strategy.",
        "published_at": "2025-11-21T11:00:00Z"
      },
      {
        "source": "The New Republic",
        "title": "Polluters Have Their Claws in These Democratic Governors",
        "url": "https://newrepublic.com/article/203472/hochul-newsom-democrats-fossil-fuels-climate",
        "description": "Last week the New York Times exposed links between New York Governor Kathy Hochul and the industries benefiting from two of her recent permit approvals: Both the pipeline company whose construction was approved and the private equity firm with a stake in a re…",
        "published_at": "2025-11-21T11:00:00Z"
      },
      {
        "source": "Omny.fm",
        "title": "Markets Poised for Seven-Month Low; Trump & Mamdani to Meet Friday",
        "url": "https://omny.fm/shows/bloomberg-daybreak/markets-poised-for-seven-month-low-trump-mamdani-to-meet-friday",
        "description": "On today's podcast:1) Global stocksxa0are poised for their worst week in seven months as concerns over lofty valuations and whether massive investments in artificial intelligence will pay off prompt investors to retreat from riskier assets. The MSCIxa0All Country…",
        "published_at": "2025-11-21T10:50:14Z"
      },
      {
        "source": "New York Magazine",
        "title": "What Mamdani’s Staffing Choices Say About How He’ll Govern",
        "url": "http://nymag.com/intelligencer/article/zohran-mamdani-mayoral-administration-staff-picks-governing-style.html",
        "description": "So far it seems like Zohran Mamdani is looking to add age, experience, and even some opposing views to his incoming mayoral administration.",
        "published_at": "2025-11-21T10:45:57Z"
      },
      {
        "source": "Slate Magazine",
        "title": "The Strange Lie People Can’t Stop Repeating About Jack Schlossberg",
        "url": "https://slate.com/life/2025/11/jack-schlossberg-kennedy-congress-rfk-jr.html",
        "description": "John F. Kennedy’s grandson might be great in Congress—but certainly not because of this.",
        "published_at": "2025-11-21T10:45:00Z"
      },
      {
        "source": "Al Jazeera English",
        "title": "Mamdani’s democratic socialism is a promise of true freedom for all",
        "url": "https://www.aljazeera.com/opinions/2025/11/21/mamdanis-democratic-socialism-is-a-promise-of-true-freedom-for-all",
        "description": "It is not communism but a vision of equality, opportunity and a life people can afford.",
        "published_at": "2025-11-21T10:29:04Z"
      },
      {
        "source": "Fox News",
        "title": "When Trump meets Mamdani: Five capitalist messages the democratic socialist should hear",
        "url": "https://www.foxnews.com/opinion/when-trump-meets-mamdani-five-capitalist-messages-democratic-socialist-should-hear",
        "description": "Two opposing worldviews on wealth creation and government redistribution set to clash Friday at the White House when President Trump and New York City mayor-elect Zohran Mamdani meet.",
        "published_at": "2025-11-21T10:00:22Z"
      },
      {
        "source": "The American Prospect",
        "title": "New York Gets Serious About Food Prices",
        "url": "http://prospect.org/2025/11/21/new-york-food-prices-mamdani-robinson-patman-act/",
        "description": "A proposed state antitrust law has the potential to cut food prices, a boon to Mayor-elect Mamdani.\nThe post New York Gets Serious About Food Prices appeared first on The American Prospect.",
        "published_at": "2025-11-21T10:00:00Z"
      },
      {
        "source": "NBC News",
        "title": "In Nevada, economic concerns threaten to wipe away the GOP's Latino voter gains",
        "url": "https://www.nbcnews.com/politics/elections/nevada-economic-concerns-threaten-wipe-away-trump-latino-voter-gains-rcna244993",
        "description": "LAS VEGAS — Matt Payan, who co-owns and operates a rare Hispanic-owned brewery in Nevada, said it was a “very slow, scary summer” for the economy in this city.“As the summer is slowly fading, business is slowly picking up, though, but not as much as we were a…",
        "published_at": "2025-11-21T10:00:00Z"
      },
      {
        "source": "NPR",
        "title": "After calling him a 'communist,' Trump will meet Mamdani in the Oval Office Friday",
        "url": "https://www.npr.org/2025/11/21/nx-s1-5615169/trump-mamdani-oval-office-communist-socialist",
        "description": "New York City Mayor-elect Zohran Mamdani will meet with President Trump at the White House Friday putting the frequent foe of conservatives face-to-face with one of his biggest critics.",
        "published_at": "2025-11-21T10:00:00Z"
      },
      {
        "source": "NPR",
        "title": "In Miami Beach, the New York City mayoral election is an opportunity",
        "url": "https://www.npr.org/2025/11/21/nx-s1-5612255/miami-beach-new-york-mamdani-times-square-billboards",
        "description": "Billboards in Times Square are inviting New York businesses to relocate to Miami Beach. They're being paid for by a Florida developer who sees the election of Zohran Mamdani as an opportunity to lure residents and businesses south.",
        "published_at": "2025-11-21T10:00:00Z"
      },
      {
        "source": "NBC News",
        "title": "Trump to meet with Zohran Mamdani after months trading barbs",
        "url": "https://www.nbcnews.com/politics/donald-trump/trump-zohran-mamdani-meet-oval-office-rcna244964",
        "description": "Donald Trump and Zohran Mamdani will sit down Friday for a meeting between the upstart mayor-elect of New York City and a president who sought to kneecap him during the campaign.",
        "published_at": "2025-11-21T10:00:00Z"
      },
      {
        "source": "Israelnationalnews.com",
        "title": "Aliyah Minister: 'Mamdani a disgrace to US, encourages hostility to Jews'",
        "url": "https://www.israelnationalnews.com/news/418137",
        "description": "Israeli Minister of Aliyah and Integration Ofir Sofer condemns NYC mayor-elect following the antisemitic protest outside Manhattan's historic Park East Synagogue.",
        "published_at": "2025-11-21T08:27:59Z"
      },
      {
        "source": "CounterPunch",
        "title": "Roaming Charges: President Bone Spurs Fetes Crown Prince Bone Saws",
        "url": "https://www.counterpunch.org/2025/11/21/390083/",
        "description": "So it's no surprise thatTrump did more than receive MBS with diplomatic niceties. He lavished praise on the smirking Prince with the eagerness if a supplicant, asserted his innocence with the fervency (if not articulateness) of a defense lawyer, throwing his …",
        "published_at": "2025-11-21T07:01:33Z"
      },
      {
        "source": "Hurriyet Daily News",
        "title": "New York's incoming leftist mayor to face off with Trump",
        "url": "https://www.hurriyetdailynews.com/new-yorks-incoming-leftist-mayor-to-face-off-with-trump-215974",
        "description": "New York's incoming leftist mayor Zohran Mamdani will meet with U.S. President Donald Trump at the White House on Friday, after an exchange of barbs that has seized national attention.",
        "published_at": "2025-11-21T06:40:46Z"
      },
      {
        "source": "The Irish Times",
        "title": "Amid ominous polls, Republicans start to express dissent towards Trump for the first time",
        "url": "https://www.irishtimes.com/world/us/2025/11/21/amid-ominous-polls-republicans-start-to-express-dissent-towards-trump-for-the-first-time/",
        "description": "A comment about the military has sharpened anxiety about what the future holds for the US",
        "published_at": "2025-11-21T06:34:17Z"
      },
      {
        "source": "Digital Journal",
        "title": "New York’s incoming leftist mayor to face off with Trump",
        "url": "https://www.digitaljournal.com/world/new-yorks-incoming-leftist-mayor-to-face-off-with-trump/article",
        "description": "New York’s incoming leftist mayor Zohran Mamdani will meet with US President Donald Trump at the White House on Friday, after an exchange of barbs that has seized national attention. Mamdani, a 34-year-old political insurgent who came from nowhere to win lead…",
        "published_at": "2025-11-21T06:02:20Z"
      },
      {
        "source": "The Daily Caller",
        "title": "JENNY BETH MARTIN: Mamdani’s Victory Means Fewer Cops, More Danger",
        "url": "https://dailycaller.com/2025/11/21/opinion-mamdanis-victory-means-fewer-cops-more-danger-jenny-beth-martin/",
        "description": "What will become of public safety in New York City, now that avowed socialist Zohran Mamdani is about to take the reins as mayor?",
        "published_at": "2025-11-21T05:14:03Z"
      },
      {
        "source": "Juancole.com",
        "title": "Trump using Jews to Ban Free Speech: The Ultimate in Antisemitism",
        "url": "https://www.juancole.com/2025/11/speech-ultimate-antisemitism.html",
        "description": "By Mattea Kramer ( Tomdispatch.com ) - Rooting out terrorism and antisemitism was the supposed reason that plainclothed ICE agents arrested doctoral student Rümeysa Öztürk on a street in Somerville, Massachusetts, after she coauthored an op-ed calling on Tuft…",
        "published_at": "2025-11-21T05:04:00Z"
      },
      {
        "source": "Americanthinker.com",
        "title": "Mamdani’s Numbnut Voters",
        "url": "https://www.americanthinker.com/articles/2025/11/mamdani_s_numbnut_voters.html",
        "description": "Photo Credit:ChatGPT\n \n ChatGPTVladimir Lenin purportedly said that it only took “four years” to plant the seed that would never be uprooted. Will this observation also apply toxa0Zohran Mamdani’s four-year term and the future of NYC?",
        "published_at": "2025-11-21T05:00:00Z"
      },
      {
        "source": "Americanthinker.com",
        "title": "Mamdani asking for trouble, again",
        "url": "https://www.americanthinker.com/blog/2025/11/mamdani_asking_for_trouble_again.html",
        "description": "Zohran Mamdani, soon-to-be mayor of New York recently confirmed that he’ll be seeking to keep Jessica Tisch in her position as police commissioner for the city, though he has yet to officially offer her the position.xa0xa0“I make th...",
        "published_at": "2025-11-21T05:00:00Z"
      },
      {
        "source": "Israelnationalnews.com",
        "title": "White House Press Secretary swipes at Mamdani ahead of Trump meeting",
        "url": "https://www.israelnationalnews.com/news/418127",
        "description": "White House Press Secretary Karoline Leavitt calls NYC Mayor-elect Mamdani “a communist” ahead of his first meeting with President Trump.",
        "published_at": "2025-11-21T04:25:27Z"
      },
      {
        "source": "The Times of India",
        "title": "Zohran Mamdani says he wants to talk affordability with Trump and isn't worried he's walking into a trap",
        "url": "https://economictimes.indiatimes.com/news/international/global-trends/zohran-mamdani-says-he-wants-to-talk-affordability-with-trump-and-isnt-worried-hes-walking-into-a-trap/articleshow/125476151.cms",
        "description": "New York City Mayor-elect Zohran Mamdani will meet President Donald Trump.  Mamdani aims to discuss the city's affordability crisis. He sees the meeting as a chance to advocate for New Yorkers.  Mamdani said he would emphasise the need for federal support, an…",
        "published_at": "2025-11-21T03:13:29Z"
      }
    ]
  },
  "bihar elections": {
    "timestamp": "2025-11-23T00:42:55.322511",
    "articles": [
      {
        "source": "Statetimes.in",
        "title": "Will throw out every ‘Ghuspaithiya’ from India: Amit Shah",
        "url": "https://statetimes.in/will-throw-out-every-ghuspaithiya-from-india-amit-shah/",
        "description": "STATE TIMES NEWS BHUJ (GUJARAT): Union Home Minister Amit Shah on Friday said the government will throw out “ghuspaithiye” (infiltrators) from the country and alleged that some political parties are opposing the SIR exercise as they want the names of infiltra…",
        "published_at": "2025-11-21T18:51:25Z"
      },
      {
        "source": "BusinessLine",
        "title": "Labour Codes trigger showdown, Unions call ‘combative resistance’ on Nov 26",
        "url": "https://www.thehindubusinessline.com/news/labour-codes-trigger-showdown-unions-call-combative-resistance-on-nov-26/article70308786.ece",
        "description": "A coalition of trade unions is staging a nationwide protest on November 26, 2025, against controversial labour codes undermining workers’ rights",
        "published_at": "2025-11-21T15:44:20Z"
      },
      {
        "source": "The Times of India",
        "title": "Bihar polls: Nearly 24,000 of over 2 lakh postal ballots rejected",
        "url": "https://economictimes.indiatimes.com/news/elections/assembly-elections/bihar/bihar-polls-nearly-24000-of-over-2-lakh-postal-ballots-rejected/articleshow/125487066.cms",
        "description": "Bihar assembly elections saw a significant number of postal ballots rejected. Election Commission data reveals almost 24,000 out of over two lakh postal votes were not counted. This occurred during the recent two-phased election. The overall voter turnout was…",
        "published_at": "2025-11-21T12:43:23Z"
      },
      {
        "source": "The Times of India",
        "title": "Bihar Congress women's wing chief resigns, dissidents demonstrate outside party office",
        "url": "https://economictimes.indiatimes.com/news/politics-and-nation/bihar-congress-womens-wing-chief-resigns-dissidents-demonstrate-outside-party-office/articleshow/125483941.cms",
        "description": "Bihar's political landscape is in upheaval as the Congress faces the fallout from disappointing assembly election results. Sarwat Jahan Fatima has stepped down as the president of Mahila Congress, citing the inadequate representation of women candidates and h…",
        "published_at": "2025-11-21T10:25:24Z"
      },
      {
        "source": "The Times of India",
        "title": "Nitish Kumar's new cabinet full of corrupts, criminals, alleges Prashant Kishor",
        "url": "https://economictimes.indiatimes.com/news/politics-and-nation/nitish-kumars-new-cabinet-full-of-corrupts-criminals-alleges-prashant-kishor/articleshow/125482661.cms",
        "description": "Prashant Kishor criticizes Nitish Kumar's new Bihar cabinet, calling it corrupt. He announces the 'Bihar Navnirman Sankalp Yatra' starting January 15. Party workers will visit every home to raise awareness about government misdeeds. Kishor pledges to donate m…",
        "published_at": "2025-11-21T09:33:28Z"
      },
      {
        "source": "The Times of India",
        "title": "SIR for purification of voters' list, Bihar win mandate against infiltrators in country: Amit Shah",
        "url": "https://economictimes.indiatimes.com/news/politics-and-nation/sir-for-purification-of-voters-list-bihar-win-mandate-against-infiltrators-in-country-amit-shah/articleshow/125482612.cms",
        "description": "Union Home Minister Amit Shah declared the BJP-led NDA's Bihar victory a mandate against infiltrators, stating parties supporting illegal immigrants will not be favored. He described the Election Commission's special intensive revision as 'purification' of vo…",
        "published_at": "2025-11-21T09:31:19Z"
      },
      {
        "source": "The Times of India",
        "title": "\"Ek ek ghuspatiye ko chun chun kar bahar nikalenge\" Amit Shah says nationwide SIR an exercise to \"protect democracy\"",
        "url": "https://economictimes.indiatimes.com/news/politics-and-nation/ek-ek-ghuspatiye-ko-chun-chun-kar-bahar-nikalenge-amit-shah-says-nationwide-sir-an-exercise-to-protect-democracy/articleshow/125480656.cms",
        "description": "In a rally focused on securing electoral integrity, Union Home Minister Amit Shah emphasized the need for widespread public backing for the Special Intensive Revision of electoral rolls. This important initiative aims to cleanse voter lists of any infiltrator…",
        "published_at": "2025-11-21T07:46:38Z"
      },
      {
        "source": "The Times of India",
        "title": "Sadhu, Subhash, & now Sanjay: The men testing Yadav clan in Bihar",
        "url": "https://economictimes.indiatimes.com/news/elections/assembly-elections/bihar/sadhu-subhash-now-sanjay-the-men-testing-yadav-clan-in-bihar-lalu-prasad-yadav-rabri-devi-tej-pratap-yadav-tejashwi-yadav/articleshow/125470479.cms",
        "description": "The Yadav family faces new political battles. Tejashwi Yadav is managing internal family disputes and party challenges. His siblings, Rohini Acharya and Tej Pratap Yadav, have voiced grievances and taken independent political steps. These family dynamics are …",
        "published_at": "2025-11-20T18:48:18Z"
      },
      {
        "source": "The Times of India",
        "title": "NDA govt to work with full commitment for all-round development of Bihar: Nitish Kumar",
        "url": "https://economictimes.indiatimes.com/news/elections/assembly-elections/bihar/nda-govt-to-work-with-full-commitment-for-all-round-development-of-bihar-nitish-kumar/articleshow/125467651.cms",
        "description": "Nitish Kumar has taken oath as Bihar's Chief Minister for a record tenth term. The new NDA government, formed by a five-party alliance, has pledged full commitment to the state's development. Prime Minister Narendra Modi and other senior leaders attended the …",
        "published_at": "2025-11-20T16:52:41Z"
      },
      {
        "source": "The Times of India",
        "title": "Lalu's former aide Ram Kripal Yadav, now minister in Nitish government, trains guns at Tejashwi",
        "url": "https://economictimes.indiatimes.com/news/elections/assembly-elections/bihar/lalus-former-aide-ram-kripal-yadav-now-minister-in-nitish-government-trains-guns-at-tejashwi/articleshow/125465297.cms",
        "description": "One of the founding members of the RJD who joined the BJP in 2014, Ram Kripal Yadav spoke to journalists here after being sworn in as a minister in the new Nitish Kumar cabinet.",
        "published_at": "2025-11-20T14:23:30Z"
      },
      {
        "source": "The Times of India",
        "title": "Lalu's former aide Ram Kripal Yadav, now minister in Nitish government, trains guns at Tejashwi",
        "url": "https://economictimes.indiatimes.com/news/elections/assembly-elections/bihar/lalus-former-aide-ram-kripal-yadav-now-minister-in-nitish-government-trains-guns-at-tejashwi/articleshow/125465334.cms",
        "description": "One of the founding members of the RJD who joined the BJP in 2014, Ram Kripal Yadav spoke to journalists here after being sworn in as a minister in the new Nitish Kumar cabinet.",
        "published_at": "2025-11-20T14:23:30Z"
      },
      {
        "source": "The Times of India",
        "title": "Bihar polls: 5 seats with highest winning margins go to NDA; lowest-margin races a mixed bag",
        "url": "https://economictimes.indiatimes.com/news/elections/assembly-elections/bihar/bihar-polls-5-seats-with-highest-winning-margins-go-to-nda-lowest-margin-races-a-mixed-bag/articleshow/125460621.cms",
        "description": "The NDA secured dominant victories in Bihar's assembly elections, particularly in constituencies with the highest winning margins, with the JD(U) and BJP achieving significant leads. In contrast, the closest races were more fragmented, featuring wins from var…",
        "published_at": "2025-11-20T10:44:34Z"
      },
      {
        "source": "The Times of India",
        "title": "Video: PM Modi's 'gamccha moment' goes viral after Nitish Kumar takes oath as Bihar CM",
        "url": "https://economictimes.indiatimes.com/news/india/viral-video-pm-modis-gamccha-moment-goes-viral-after-nitish-kumar-takes-oath-as-bihar-cm-watch/articleshow/125460201.cms",
        "description": "Nitish Kumar took oath as Bihar Chief Minister for the tenth time. Prime Minister Narendra Modi's gesture of waving a gamchha captivated the crowd. The event at Patna's Gandhi Maidan was a grand spectacle. Top leaders attended the ceremony. Cultural performan…",
        "published_at": "2025-11-20T10:42:21Z"
      },
      {
        "source": "The Times of India",
        "title": "Confident that new NDA govt in Bihar will accelerate state's progress: S Jaishankar",
        "url": "https://economictimes.indiatimes.com/news/politics-and-nation/confident-that-new-nda-govt-in-bihar-will-accelerate-states-progress-s-jaishankar/articleshow/125459746.cms",
        "description": "Nitish Kumar has taken oath as Bihar Chief Minister for a record tenth term. The new NDA government in the state includes 26 ministers from various alliance partners. This government aims to speed up Bihar's development. The NDA secured a majority in the rece…",
        "published_at": "2025-11-20T10:05:05Z"
      },
      {
        "source": "The Times of India",
        "title": "Tejashwi Yadav congratulates Nitish Kumar after swearing-in ceremony, urges new govt to deliver on promises",
        "url": "https://economictimes.indiatimes.com/news/elections/assembly-elections/bihar/tejashwi-yadav-congratulates-nitish-kumar-after-swearing-in-ceremony-urges-new-govt-to-deliver-on-promises/articleshow/125457979.cms",
        "description": "Amidst a flurry of political activity, Nitish Kumar has taken his oath as Bihar's Chief Minister for the tenth time, making history in the process. Tejashwi Yadav, who ran against him, offered his congratulations while voicing his hopes that the incoming gove…",
        "published_at": "2025-11-20T08:49:39Z"
      },
      {
        "source": "The Indian Express",
        "title": "India remains ‘an obscenely unequal country’; scams are operations anchored in caste and community networks: Snigdha Poonam",
        "url": "https://indianexpress.com/article/research/india-remains-an-obscenely-unequal-country-scams-are-operations-anchored-in-caste-and-community-networks-snigdha-poonam-10376048/",
        "description": "In an interview with Nikita Mohta, Snigdha Poonam talks about her latest book, Scamlands, which offers a gripping account of the people and forces behind frauds in India, Asia and beyond, revealing how inequality, discrimination and desire drive scammers.",
        "published_at": "2025-11-20T08:34:13Z"
      },
      {
        "source": "BusinessLine",
        "title": "Nitish Kumar sworn in as Bihar Chief Minister, 21 MLAs take oath as ministers",
        "url": "https://www.thehindubusinessline.com/news/nitish-kumar-sworn-in-as-bihar-chief-minister-21-mlas-take-oath-as-ministers/article70302174.ece",
        "description": "JD(U) supremo Nitish Kumar on Thursday was sworn in as the Chief Minister of Bihar for a record 10th time at the Gandhi Maidan here. In all, 22 ministers, including Kumar, were sworn in at the event.",
        "published_at": "2025-11-20T07:15:41Z"
      },
      {
        "source": "BBC News",
        "title": "Modi's ally returns as chief minister after sweeping Indian state polls",
        "url": "https://www.bbc.com/news/articles/cx2y27y7yj6o",
        "description": "Nitish Kumar’s party and its allies, which includes PM Narendra Modi’s BJP, won 202 out of 243 seats.",
        "published_at": "2025-11-20T06:52:52Z"
      },
      {
        "source": "Economictimes.com",
        "title": "\\u200bu200bTen oaths in just 25 years! How has Nitish Kumar kept returning as Bihar CM? Here’s how he was able to do itu200b",
        "url": "https://m.economictimes.com/news/india/-ten-oaths-in-just-25-years-how-has-nitish-kumar-kept-returning-as-bihar-cm-heres-how-he-was-able-to-do-it-/nitish-kumar-takes-oath-as-bihar-chief-minister-for-10th-time/slideshow/125455004.cms",
        "description": "On November 20, 2025, Nitish Kumar took his tenth oath as Chief Minister of Bihar—an extraordinary feat inside a 25‑year window when only five full terms could theoretically fit. Between March 2000 and today, only two others briefly interrupted Nitish's tenur…",
        "published_at": "2025-11-20T06:13:57Z"
      },
      {
        "source": "The Times of India",
        "title": "Nitish Kumar's Dashavtar begins: 'Paltu Ram' takes oath as Bihar CM for 10th time",
        "url": "https://economictimes.indiatimes.com/news/politics-and-nation/bihar-cm-nitish-kumar-oath-taking-ceremony-bihar-cm-shapath-grahan/articleshow/125452756.cms",
        "description": "Nitish Kumar secured an unprecedented tenth term as Bihar's Chief Minister following a landslide victory for the NDA. The alliance clinched 202 out of 243 seats, with the BJP and JD(U) forming the core of the new government. Key positions and cabinet selectio…",
        "published_at": "2025-11-20T06:05:58Z"
      },
      {
        "source": "The Times of India",
        "title": "Nitish Kumar's new cabinet ministers list: Who gets what as Bihar's Sushashan Babu starts 10th innings",
        "url": "https://economictimes.indiatimes.com/news/politics-and-nation/nitish-kumars-new-cabinet-ministers-list-who-gets-what-as-bihars-sushashan-babu-starts-10th-innings/articleshow/125451780.cms",
        "description": "Nitish Kumar will be sworn in as Bihar's Chief Minister for the tenth time on Thursday. Samrat Choudhary and Vijay Kumar Sinha will serve as Deputy Chief Ministers. The NDA secured a decisive victory in the assembly elections. The new cabinet is expected to i…",
        "published_at": "2025-11-20T03:14:52Z"
      },
      {
        "source": "Foreign Policy",
        "title": "Hasina Verdict Raises Specter of Violence in Bangladesh",
        "url": "http://foreignpolicy.com/2025/11/19/bangladesh-hasina-verdict-election-violence-awami-league/",
        "description": "The former prime minister was sentenced to death in absentia months before a high-stakes election.",
        "published_at": "2025-11-19T21:43:57Z"
      },
      {
        "source": "The Times of India",
        "title": "Seemanchal leads female turnout in Bihar elections: NDA wins 2 seats, AIMIM 3",
        "url": "https://economictimes.indiatimes.com/news/politics-and-nation/seemanchal-leads-female-turnout-in-bihar-elections-nda-wins-2-seats-aimim-3/articleshow/125444057.cms",
        "description": "Female turnout in the Bihar election was highest in Seemanchal, with all five top-performing constituencies crossing 88% participation. AIMIM won three of these seats, while the BJP and JDU took one each. Thakurganj recorded the highest female turnout at 90.2…",
        "published_at": "2025-11-19T17:56:30Z"
      },
      {
        "source": "The Times of India",
        "title": "Naidu, Nara Lokesh to attend Nitish Kumar's swearing-in as Bihar CM",
        "url": "https://economictimes.indiatimes.com/news/elections/assembly-elections/bihar/andhra-pradesh-chief-minister-n-chandrababu-naidu-nara-lokesh-to-attend-nitish-kumars-swearing-in-as-bihar-cm/articleshow/125441187.cms",
        "description": "On November 20, Andhra Pradesh’s top leaders, Chief Minister N Chandrababu Naidu and IT Minister Nara Lokesh, are set to join the festivities at Gandhi Maidan in Patna to celebrate Nitish Kumar’s swearing-in for his record-setting tenth term as Chief Minister.",
        "published_at": "2025-11-19T15:43:04Z"
      },
      {
        "source": "The Times of India",
        "title": "School Holiday Tomorrow, 20 November 2025: What’s closed, what’s open? full state-wise update inside",
        "url": "https://economictimes.indiatimes.com/news/new-updates/school-holiday-tomorrow-20-november-2025-whats-closed-whats-open-full-state-wise-update-inside/articleshow/125439394.cms",
        "description": "Schools across India will largely remain open on Thursday, November 20, 2025, with Punjab and Chandigarh observing a holiday for Martyrdom Day of Guru Tegh Bahadur Ji. Tamil Nadu faces potential closures due to heavy rainfall alerts, with decisions pending lo…",
        "published_at": "2025-11-19T14:11:57Z"
      },
      {
        "source": "BusinessLine",
        "title": "How freebies in election campaigns are increasing post-election expenditure across States",
        "url": "https://www.thehindubusinessline.com/data-stories/data-focus/how-freebies-in-election-campaigns-are-increasing-post-election-expenditure/article70298491.ece",
        "description": "The NDA’s sweeping Bihar victory was powered by a record female turnout, with the report noting that “one of the key drivers of this record turnout was the ₹10,000 grant to women to women, proving once again that freebies/populist spendings are now an inextricable par…",
        "published_at": "2025-11-19T13:04:47Z"
      },
      {
        "source": "The Times of India",
        "title": "'My decision not to contest Bihar polls can be considered mistake': Prashant Kishor",
        "url": "https://economictimes.indiatimes.com/news/elections/assembly-elections/bihar/my-decision-not-to-contest-bihar-polls-can-be-considered-mistake-prashant-kishor/articleshow/125434897.cms",
        "description": "Prashant Kishor, the driving force behind Jan Suraaj, admits that opting out of the Bihar assembly elections may have been a misstep. With his party capturing under four percent of the votes, Kishor’s determination to alter the political landscape in Bihar re…",
        "published_at": "2025-11-19T10:47:56Z"
      },
      {
        "source": "The Times of India",
        "title": "Nitish Kumar set to be Bihar CM for record 10th time, NDA elects him leader of legislature party",
        "url": "https://economictimes.indiatimes.com/news/elections/assembly-elections/bihar/nitish-kumar-set-to-be-bihar-cm-for-record-10th-time-nda-elects-him-leader-of-legislature-party/articleshow/125434492.cms",
        "description": "Nitish Kumar will form Bihar's government for a record tenth time, leading the NDA after securing a decisive victory. He will be sworn in as Chief Minister on Thursday, with Samrat Choudhary as his deputy. The NDA alliance secured 202 seats in the 243-member …",
        "published_at": "2025-11-19T10:47:02Z"
      },
      {
        "source": "Ndtvprofit.com",
        "title": "Nitish Kumar Confirmed As Bihar Chief Minister After NDA's Historic Win",
        "url": "https://www.ndtvprofit.com/politics/nitish-kumar-confirmed-as-bihar-chief-minister-after-ndas-historic-win",
        "description": "Nitish Kumar, who has been the chief minister of Bihar for most of the last two decades, has been confirmed for the top post again by the National Democratic Alliance (NDA), following its historic win in the recently concluded assembly elections.",
        "published_at": "2025-11-19T10:33:33Z"
      },
      {
        "source": "BusinessLine",
        "title": "Nitish Kumar chosen as leader of JD(U) legislature party in Bihar",
        "url": "https://www.thehindubusinessline.com/news/nitish-kumar-chosen-as-leader-of-jdu-legislature-party-in-bihar/article70298216.ece",
        "description": "Nitish set to be elected leader of the NDA during a meeting of the constituents of the five-party alliance",
        "published_at": "2025-11-19T08:54:39Z"
      },
      {
        "source": "The Times of India",
        "title": "US tech correction long overdue, India to see flow impact: Rahul Arora",
        "url": "https://economictimes.indiatimes.com/markets/expert-view/us-tech-correction-long-overdue-india-to-see-flow-impact-rahul-arora/articleshow/125431811.cms",
        "description": "US equity markets are experiencing a long-overdue correction, impacting global flows into Asia. While India's fundamentals remain strong, foreign investor sentiment is shifting. Market expert Rahul Arora advises caution on consumer staples, favoring discretio…",
        "published_at": "2025-11-19T08:37:58Z"
      },
      {
        "source": "The Times of India",
        "title": "Nitish Kumar, Samrat Choudhary chosen as JD(U), BJP legislative party heads in Bihar",
        "url": "https://economictimes.indiatimes.com/news/elections/assembly-elections/bihar/nitish-kumar-samrat-choudhary-chosen-as-jdu-bjp-legislative-party-heads-in-bihar/articleshow/125430669.cms",
        "description": "Nitish Kumar and Samrat Choudhary are set to lead Bihar's new government. They were unanimously chosen to head their respective party legislature groups. This follows the NDA's strong performance in the recent assembly elections. The new government is slated …",
        "published_at": "2025-11-19T07:48:09Z"
      },
      {
        "source": "Ndtvprofit.com",
        "title": "Ahmed Patel's Daughter Hits Out At Congress: 'Can't Function Like We Did 10 Years Ago'",
        "url": "https://www.ndtvprofit.com/politics/ahmed-patels-daughter-mumtaz-patel-hits-out-at-congress-cant-function-like-we-did-10-years-ago",
        "description": "In a candid and critical message, Mumtaz Patel, daughter of veteran Congress leader Ahmed Patel, has sounded a wake-up call for the party, expressing her concerns over its performance in the Bihar elections. In a recent interview with NDTV's Shiv Aroor, Mumta…",
        "published_at": "2025-11-19T05:04:52Z"
      },
      {
        "source": "The Times of India",
        "title": "Tejashwi Yadav: From Bihar’s youngest deputy CM to a leader cornered by defeat, dissent and family strife",
        "url": "https://economictimes.indiatimes.com/news/politics-and-nation/tejashwi-yadav-from-bihars-youngest-deputy-cm-to-a-leader-cornered-by-defeat-dissent-and-family-strife/articleshow/125426914.cms",
        "description": "When Nitish Kumar switched sides in August 2022 to form a government with the RJD, Tejashwi returned as Deputy Chief Minister with greater experience and confidence. He oversaw recruitment drives and witnessed more than five lakh government jobs being filled.…",
        "published_at": "2025-11-19T04:29:31Z"
      },
      {
        "source": "BusinessLine",
        "title": "Stocks open flat amid global tech selloff, experts say markets will follow global trends",
        "url": "https://www.thehindubusinessline.com/markets/stocks-open-flat-amid-global-tech-selloff-experts-say-markets-will-follow-global-trends/article70297518.ece",
        "description": "While the government has extended income tax and GST rebates to stimulate consumption, the absence of broad-based wage growth is restricting economic momentum",
        "published_at": "2025-11-19T04:24:25Z"
      },
      {
        "source": "The Times of India",
        "title": "Kerala govt moves Supreme Court for deferment of SIR exercise untill local body elections",
        "url": "https://economictimes.indiatimes.com/news/india/kerala-govt-moves-supreme-court-for-deferment-of-sir-exercise-untill-local-body-elections/articleshow/125419244.cms",
        "description": "Kerala's government has moved the Supreme Court. It seeks to halt a special revision of electoral rolls. The state fears this will clash with local body elections in December. Conducting both simultaneously could create administrative chaos. The court is aske…",
        "published_at": "2025-11-18T18:40:31Z"
      },
      {
        "source": "Mypeoplesreview.com",
        "title": "Review of World Affairs",
        "url": "https://mypeoplesreview.com/2025/11/19/review-of-world-affairs-72/",
        "description": "By Shashi P.B.B. Malla Elections in Bihar State, India People in India were following the state election campaign in India’s […]\nThe post Review of World Affairs appeared first on Peoples' Review.",
        "published_at": "2025-11-18T18:25:00Z"
      },
      {
        "source": "RT",
        "title": "The great South Asian Gen Z meltdown – why does this one country seem immune?",
        "url": "https://www.rt.com/india/627932-new-great-game-in-south-asia/",
        "description": "While the Western media hails the ‘Gen-Z’ protests, India is keeping a watchful eye on the chaos unfolding in its neighborhood Read Full Article at RT.com",
        "published_at": "2025-11-18T17:07:04Z"
      },
      {
        "source": "The Times of India",
        "title": "Raj wasn't there in Bihar polls: Shiv Sena (UBT) on Congress going solo in BMC election",
        "url": "https://economictimes.indiatimes.com/news/politics-and-nation/raj-wasnt-there-in-bihar-polls-shiv-sena-ubt-on-congress-going-solo-in-bmc-election/articleshow/125413630.cms",
        "description": "Shiv Sena (UBT) is championing the cause of collaboration, urging the Congress party to join ranks as Mumbai gears up for the crucial Brihanmumbai Municipal Corporation elections. The party cautions that a fragmented opposition could play into the BJP's hands…",
        "published_at": "2025-11-18T13:57:16Z"
      },
      {
        "source": "The Indian Express",
        "title": "5 stories you must read today, November 18: From Prashant Kishor taking full responsibility for the poll debacle to X down for users worldwide",
        "url": "https://indianexpress.com/article/india/5-stories-you-must-read-today-november-18-from-prashant-kishor-taking-full-responsibility-for-the-poll-debacle-to-x-down-for-users-worldwide-10372687/",
        "description": "Read about the Shashi Tharoor's praise for PM Modi, Anmol Bishnoi's extradition from US, EAM Jaishankar's comment on terrorism at SCO Summit and more, here.",
        "published_at": "2025-11-18T13:57:00Z"
      },
      {
        "source": "The Times of India",
        "title": "November 19 school closure alert: Are schools in Tamil Nadu, Kerala, or other states closed due to rain or poor AQI?",
        "url": "https://economictimes.indiatimes.com/news/new-updates/november-19-school-closure-alert-are-schools-in-tamil-nadu-kerala-or-other-states-closed-due-to-rain-or-poor-aqi/articleshow/125413424.cms",
        "description": "Schools in Tamil Nadu may face closures on November 19 due to heavy rain alerts. Other states like Uttar Pradesh, Bihar, Andhra Pradesh, Telangana, and Odisha are expected to have normal school operations. Parents and students should stay updated with local s…",
        "published_at": "2025-11-18T13:54:11Z"
      },
      {
        "source": "The Indian Express",
        "title": "After Bihar poll drubbing, Prashant Kishor’s ‘I will quit politics’ claim over Nitish Kumar’s Rs 2 lakh promise",
        "url": "https://indianexpress.com/article/india/after-bihar-poll-drubbing-prashant-kishors-i-will-quit-politics-claim-over-nitish-kumars-rs-2-lakh-promise-10372589/",
        "description": "During his poll campaign, sensing strong anti-incumbency, the political-analyst-turned-politician had said he would resign from politics if the Nitish Kumar-led Janata Dal United won more than 25 seats in the assembly elections.",
        "published_at": "2025-11-18T12:42:39Z"
      },
      {
        "source": "The Times of India",
        "title": "'Must the guts': Rohini Acharya invites open debate over donating 'filthy kidney' to father Lalu Yadav",
        "url": "https://economictimes.indiatimes.com/news/elections/assembly-elections/bihar/must-the-guts-rohini-acharya-invites-open-debate-over-donating-filthy-kidney-to-father-lalu-yadav/articleshow/125411390.cms",
        "description": "Rohini Acharya, the daughter of politician Lalu Prasad, has taken a bold stand in response to harsh criticism following her kidney donation to her father. With a fierce rebuttal to detractors doubting her intentions, she posed a challenge for them to extend t…",
        "published_at": "2025-11-18T12:18:59Z"
      },
      {
        "source": "The Times of India",
        "title": "Congress show-causes 43 leaders for anti-party activities during Bihar polls",
        "url": "https://economictimes.indiatimes.com/news/elections/assembly-elections/bihar/congress-show-causes-43-leaders-for-anti-party-activities-during-bihar-polls/articleshow/125409755.cms",
        "description": "In a bold move, the Congress party has dispatched show-cause notices to 43 of its Bihar leaders. These individuals stand accused of undermining party unity during the recent assembly elections by making statements that stray from the official party stance.",
        "published_at": "2025-11-18T10:46:52Z"
      },
      {
        "source": "The Indian Express",
        "title": "NIOS announces revised exam schedule for Classes 10 & 12",
        "url": ""
      }
    ]
  }
}